
'''
brief block
'''

not_influence_text = '''Температура воздуха оказывает значительное влияние на клев в случае резких перепадов температуры. В случае же небольших изменений температуры воздуха клев {} может изменится за счет других факторов. '''

influence_text = '''Для {} даже несильные колебания температуры воздуха могут повлиять на ее клев. Наш алгоритм прогноза учитывает это. '''

'''
fish block
'''

pos_neg_fish = '''На {} положительно влияет {} температуры воздуха, а ее {} способствует уменьшению активности рыбы. '''

pos_fish = '''{} температуры воздуха благоприятно влияет на клев {}. '''

neg_fish = '''{} температуры воздуха может негативно повлиять на клев {}. '''

none_fish = '''На данный момент точно неизвестно, как именно влияет изменения температуры воздуха на клев {}. '''

'''
desc block
'''

stab_desc = '''{} ожидаются небольшие изменения температуры воздуха. '''

hard_low_desc = '''{} ожидается резкое понижение температуры воздуха. '''

hard_up_desc = '''{} ожидается резкое повыщение температуры воздуха. '''

minmax_desc = '''Минимальная температура воздуха - {}, максимальная - {}. '''