'''
brief block
'''

brief_text = '''Погодные явления оказывают влияние на клев <strong>{}</strong> по-разному в зависимости от времени года и климата соответствующего региона.  '''

'''
warning block
'''

warning_text = '''На данный момент для того, чтобы сказать как влияют погодные явления на клев {} в данном регионе, нам необходимо больше данных. Для этого необходимо больше отчетов с рыбалок в этом регионе. Вы можете <strong>оставить отчет</strong> и помочь выявить закономерности нашему алгоритму более точно. '''

'''
desc block
'''

desc_text_raining1 = '''<strong>{}</strong> ожидается дождь. '''

desc_text_raining2 = '''<strong>{}</strong> ожидаются дожди. '''

desc_text_storms1 = '''<strong>{}</strong> возможна гроза. '''

desc_text_storms2 = '''<strong>{}</strong> возможны грозы. '''

desc_text_nothing = '''<strong>{}</strong> осадков не ожидается. '''