'''
brief block
'''

brief_text = '''Погодные явления оказывают влияние на клев <strong>{}</strong> по-разному в зависимости от времени года и климата соответствующего региона.  '''

'''
warning block
'''

warning_text = '''На данный момент для определения степени влияния погодных явлений на клев <strong>{}</strong> в данном регионе необходимо больше данных. Вы можете <strong>оставить отчет</strong> о рыбалке в {} и помочь выявить закономерности нашему алгоритму. '''

'''
desc block
'''

extremal_raining = '''В этот день прогнозируется самая дождливая погода за <strong>{}</strong> - <strong>{}</strong>. Возможно резкое изменение клева.'''
extremal_snow = '''В этот день прогнозируется самое большое количество выпавшего снега за <strong>{}</strong> - <strong>{}</strong>. Возможно резкое изменение клева.'''
three_days_hot = '''За период <strong>{}</strong> - <strong>{}</strong> наблюдается очень высокая температура воздуха. Это может плохо сказаться на активности рыбы.'''
dull_extremal = '''За период <strong>{}</strong> - <strong>{}</strong> в основном наблюдается пасмурная погода. Это может плохо сказаться на солнечной активности рыбы.'''
