'''
brief block
'''

brief_text = '''Погодные явления оказывают влияние на клев <strong>{}</strong> по-разному в зависимости от времени года и климата соответствующего региона.  '''

'''
warning block
'''

warning_text = '''На данный момент для определения степени влияния погодных явлений на клев <strong>{}</strong> в данном регионе необходимо больше данных. Вы можете <strong>оставить отчет</strong> о рыбалке в {} и помочь выявить закономерности нашему алгоритму. '''

'''
desc block
'''

extremal_raining = '''В этот день прогнозируется самая дождливая погода за <strong>{}</strong> - <strong>{}</strong>. Возможно резкое измнение клева по сравнению с предыдущем днем.'''
extremal_snow = '''В этот день прогнозируется самоя большое количество выпавшего снега за <strong>{}</strong> - <strong>{}</strong>. Возможно резкое изменение клева по сравнению с предыдущем днем.'''
three_days_hot = '''Последние несколько дней наблюдается очень высокая температура воздуха. Это может плохо сказаться на активности рыбы.'''
