import {convertDataFromServer} from "../convertDataFromServer/index.js";

const dataFromServer = {
    "id": 1,
    "temperature_min": "[3, 0, 2, 0, 0, 4, 6, 1, 5]",
    "temperature_mean": "[5.25, 4.25, 4.875, 4.25, 4.75, 6.625, 7, 8.25, 12.125]",
    "temperature_max": "[7, 8, 8, 8, 9, 10, 9, 15, 19]",
    "wind_mean": "[1.25, 1.875, 2.125, 4.75, 1.375, 4.125, 3.625, 1.375, 2.875]",
    "wind_direction": "['штиль', 'С', 'СЗ', 'СЗ', 'З', 'В', 'СВ', 'СЗ', 'ЮВ']",
    "gust_max": "[7, 6, 8, 13, 5, 13, 13, 6, 8]",
    "phenomenon": "[\"['пасмурно', ' небольшой дождь', ' осадки']\", \"['пасмурно', 'малооблачно', 'ясно']\", \"['пасмурно', 'облачно', ' небольшой дождь']\", \"['пасмурно', 'малооблачно', ' небольшой дождь']\", \"['пасмурно', ' небольшой дождь', 'облачно']\", \"['пасмурно', ' дождь', ' небольшой дождь']\", \"['пасмурно', ' дождь', ' небольшой дождь']\", \"['облачно', 'ясно', 'малооблачно']\", \"['ясно']\"]",
    "pressure_min": "[733, 735, 740, 741, 742, 739, 738, 745, 749]",
    "pressure_max": "[734, 740, 741, 744, 744, 743, 744, 749, 752]",
    "humidity_mean": "[0.82, 0.61875, 0.58, 0.62375, 0.66125, 0.8725, 0.91625, 0.79125, 0.665]",
    "uv_index_mean": "[0.625, 1, 0.625, 1, 1, 0.625, 0.375, 1.375, 1.375]",
    "moon": "[0.05, 0.11, 0.18, 0.26, 0.36, 0.46, 0.57, 0.68, 0.78]",
    "moon_direction": "[1, 1, 1, 1, 1, 1, 1, 1, 1]",
    "date": "2020-04-25",
    "areal": "московская область",
    "city": "москва",
    "fish": "щука",
    "prob_min": "[0.62, 0.56, 0.65, 0.68, 0.78, 0.57, 0.62, 0.62, 0.71]",
    "prob_max": "[0.69, 0.67, 0.72, 0.86, 0.84, 0.81, 0.73, 0.72, 0.84]"
}
const result = convertDataFromServer(dataFromServer)

console.log(result)
