export default () => {
  const data = {
    'Алтайский край': ['Барнаул', 'Бийск', 'Рубцовск'],
    'Амурская область': ['Белогорск', 'Благовещенск', 'Свободный', 'Тында'],
    'Архангельская область': ['Архангельск', 'Котлас', 'Северодвинск'],
    'Астраханская область': ['Астрахань', 'Ахтубинск'],
    'Белгородская область': ['Белгород', 'Старый Оскол'],
    'Брянская область': ['Брянск', 'Клинцы'],
    'Владимирская область': ['Владимир', 'Ковров', 'Муром'],
    'Волгоградская область': ['Волгоград', 'Волжский', 'Камышин', 'Михайловка'],
    'Вологодская область': ['Великий устюг', 'Вологда', 'Череповец'],
    'Воронежская область': ['Воронеж', 'Лиски'],
    'Еврейская автономная область': ['Биробиджан', 'Облучье'],
    'Забайкальский край': ['Краснокаменск', 'Чита'],
    'Ивановская область': ['Иваново', 'Кинешма', 'Шуя'],
    'Иркутская область': ['Ангарск', 'Братск', 'Иркутск', 'Усть-Илимск'],
    'Кабардино-Балкарская республика': [
      'Азау',
      'Майский',
      'Нальчик',
      'Эльбрус',
    ],
    'Калининградская область': ['Калининград'],
    'Калужская область': ['Калуга', 'Обнинск'],
    'Камчатский край': ['Елизово', 'Петропаловск-Камчатский'],
    'Карачаево-Черкесская республика': ['Архыз', 'Домбай', 'Черкесск'],
    'Кемеровская область': ['Белово', 'Кемерово', 'Новокузнецк'],
    'Кировская область': ['Киров'],
    'Костромская область': ['Кострома', 'Шарья'],
    'Краснодарский край': ['Краснодар', 'Новороссийск', 'Сочи'],
    'Красноярский край': ['Ачинск', 'Красноярск', 'Норильск'],
    'Курганская область': ['Курган', 'Шадринск'],
    'Курская область': ['Железногорск', 'Курск'],
    'Ленинградская область': [
      'Всеволжск',
      'Выборг',
      'Луга',
      'Санкт-Петербург',
      'Сосновый Бор',
    ],
    'Липецкая область': ['Елец', 'Липецк'],
    'Магаданская область': ['Магадан'],
    'Московская область': [
      'Балашиха',
      'Дмитров',
      'Дубна',
      'Королев',
      'Москва',
      'Одинцово',
      'Подольск',
      'Сергиев Посад',
      'Щелково',
    ],
  }
  const keys = Object.keys(data)
  const values = Object.values(data)
  const result = {}
  const tempResult = []
  values.forEach((value) => {
    const box = {}
    value.forEach((item) => {
      if (!box[item[0]]) box[item[0]] = {}
      box[item[0]][item] = item
    })
    tempResult.push(box)
  })

  keys.forEach((key, index) => {
    data[key] = tempResult[index]
  })
  keys.forEach((key) => {
    if (!result[key[0]]) result[key[0]] = {}
    result[key[0]][key] = data[key]
  })

  return result
}
