cases = {
    'щука': {
        'r': 'щуки', 'd': 'щуку', 'temperature+': 'понижение', 'temperature-': 'резкое повышение'
    },
    'сом': {
        'r': 'сома', 'd': 'сома', 'temperature+': None, 'temperature-': None
    },
    'судак': {
        'r': 'судака', 'd': 'судака', 'temperature+': None, 'temperature-': None
    },
    'окунь': {
        'r': 'окуня', 'd': 'окуня', 'temperature+': 'повышение', 'temperature-': None
    },
    'берш': {
        'r': 'берша', 'd': 'берша', 'temperature+': None, 'temperature-': None
    },
    'речная форель': {
        'r': 'речной форели', 'd': 'ручную форель', 'temperature+': 'понижение', 'temperature-': 'резкое повышение'
    },
    'озерная форель': {
        'r': 'озерной форели', 'd': 'озерную форель', 'temperature+': 'понижение', 'temperature-': 'резкое повышение'
    },
    'елец': {
        'r': 'ельца', 'd': 'ельца', 'temperature+': 'повышение', 'temperature-': 'резкое понижение'
    },
    'чехонь': {
        'r': 'чехони', 'd': 'чехонь', 'temperature+': 'повышение', 'temperature-': None
    },
    'голавль': {
        'r': 'голавля', 'd': 'голавля', 'temperature+': 'повышение', 'temperature-': 'резкое понижение'
    },
    'язь': {
        'r': 'язя', 'd': 'язя', 'temperature+': 'повышение', 'temperature-': 'резкое понижение'
    },
    'карп': {
        'r': 'карпа', 'd': 'карпа', 'temperature+': 'повышение', 'temperature-': 'резкое понижение'
    },
    'жерех': {
        'r': 'жереха', 'd': 'жереха', 'temperature+': 'повышение', 'temperature-': None
    },
    'лещ': {
        'r': 'леща', 'd': 'леща', 'temperature+': 'повышение', 'temperature-': 'резкое понижение'
    },
    'карась': {
        'r': 'карася', 'd': 'карася', 'temperature+': 'повышение', 'temperature-': 'резкое понижение'
    },
    'линь': {
        'r': 'линя', 'd': 'линя', 'temperature+': 'повышение', 'temperature-': 'резкое понижение'
    },
    'пескарь': {
        'r': 'пескаря', 'd': 'пескаря', 'temperature+': 'повышение', 'temperature-': None
    },
    'ротан': {
        'r': 'ротана', 'd': 'ротана', 'temperature+': None, 'temperature-': None
    },
    'плотва': {
        'r': 'плотвы', 'd': 'плотву', 'temperature+': 'повышение', 'temperature-': 'резкое понижение'
    },
    'красноперка': {
        'r': 'красноперки', 'd': 'красноперку', 'temperature+': 'повышение', 'temperature-': 'резкое понижение'
    },
    'налим': {
        'r': 'налима', 'd': 'налима', 'temperature+': 'понижение', 'temperature-': 'повышение'
    },
    'густера': {
        'r': 'густеры', 'd': 'густеру', 'temperature+': 'повышение', 'temperature-': 'резкое понижение'
    },
    'амур': {
        'r': 'амура', 'd': 'амура', 'temperature+': 'повышение', 'temperature-': 'понижение'
    },
    'ерш': {
        'r': 'ерша', 'd': 'ерша', 'temperature+': None, 'temperature-': None
    },
    'сазан': {
        'r': 'сазана', 'd': 'сазана', 'temperature+': 'повышение', 'temperature-': 'резкое понижение'
    },
    'подуст': {
        'r': 'подуста', 'd': 'подуста', 'temperature+': None, 'temperature-': None
    },
    'толстолобик': {
        'r': 'толстолобика', 'd': 'толстолобика', 'temperature+': 'повышение', 'temperature-': 'резкое понижение'
    },
    'вобла': {
        'r': 'воблы', 'd': 'воблу', 'temperature+': 'повышение', 'temperature-': 'резкое понижение'
    },
}